{
  "create": {
    "empty": {
      "title": "No Price Created",
      "info": "This data set has no price yet. As the publisher you can create a fixed price, or a dynamic price for it. Onwards!",
      "action": {
        "name": "Create Pricing",
        "help": "Create Pricing will mint your datatokens, approve spending, and create either a pool or a fixed rate exchange in one process. You will need to approve those multiple steps in your wallet."
      }
    },
    "fixed": {
      "title": "Fixed",
      "info": "Set your price for accessing this data set. The datatoken for this data set will be worth the entered amount of OCEAN.",
      "tooltips": {
        "communityFee": "This fees go to [OceanDAO](https://oceanprotocol.com/dao) for teams to improve the tools, build apps, do outreach, and more. A small fraction also goes to burning OCEAN. These fees are collected in the action of consuming a data asset.",
        "marketplaceFee": "This fee goes to the marketplace that is providing the consume-side functionality. In Ocean Market, these fees are collected in the action of consuming a data asset and are treated as Network Revenue that goes to the Ocean Community."
      }
    },
    "dynamic": {
      "title": "Dynamic",
      "info": "Let's create a decentralized, automated market for your data set. The datatoken for this data set will be worth the entered amount of OCEAN. Additionally, you will provide liquidity into a Datatoken/OCEAN liquidity pool with Balancer.",
      "tooltips": {
        "poolInfo": "The liquidity pool provides the funds for traders to trade against. The price of the asset is determined by the ration of OCEAN to datatokens.",
        "swapFee": "This transaction fee is shared among the Liquidity Providers when datatokens are purchased. The fee is set by the creator of the pool and is used to incentivize Liquidity Providers to join the pool.",
        "communityFee": "This fees go to [OceanDAO](https://oceanprotocol.com/dao) for teams to improve the tools, build apps, do outreach, and more. A small fraction also goes to burning OCEAN. These fees are collected in the action of consuming a data asset.",
        "marketplaceFee": "This fee goes to the marketplace that is providing the consume-side functionality. In Ocean Market, these fees are collected in the action of consuming a data asset and are treated as Network Revenue that goes to the Ocean Community."
      }
    },
    "free": {
      "title": "Free",
      "info": "Set your data set as free. The datatoken for this data set will be given for free via creating a faucet."
    }
  },
  "pool": {
    "tooltips": {
      "price": "The price is determined by an automated market maker, which is a type of decentralized exchange protocol that relies on a mathematical formula. It is an alternative to a traditional order book.",
      "liquidity": "Providing liquidity will earn you SWAPFEE% on every transaction in this pool, proportionally to your share of the pool."
    },
    "add": {
      "title": "Add Liquidity",
      "output": {
        "help": "Providing liquidity will earn you SWAPFEE% on every transaction in this pool, proportionally to your share of the pool. Your token input will be converted based on the weight of the pool.",
        "titleIn": "You will receive",
        "titleOut": "Pool conversion"
      },
      "action": "Approve & Supply",
      "warning": "Use at your own risk. Please familiarize yourself [with the risks](https://blog.oceanprotocol.com/on-staking-on-data-in-ocean-market-3d8e09eb0a13) and the [Terms of Use](/terms)."
    },
    "remove": {
      "title": "Remove Liquidity",
      "simple": "Set the amount of your pool shares to spend. You will get the equivalent value in OCEAN, limited to maximum amount for pool protection. If you have Datatokens left in your wallet, you can add them to the pool to increase the maximum amount.",
      "advanced": "Set the amount of your pool shares to spend. You will get OCEAN and Datatokens equivalent to your pool share, without any limit. You can use these Datatokens in other DeFi tools.",
      "output": {
        "titleIn": "You will spend",
        "titleOut": "You will receive"
      },
      "action": "Approve & Remove"
    }
  },
  "trade": {
    "action": "Approve & Swap",
    "warning": "Use at your own risk. Please familiarize yourself [with the risks](https://blog.oceanprotocol.com/on-staking-on-data-in-ocean-market-3d8e09eb0a13) and the [Terms of Use](/terms)."
  }
}
