{
  "create": {
    "empty": {
      "title": "No Price Created",
      "info": "This data set has no price yet. As the publisher you can create a fixed price, or a dynamic price for it. Onwards!",
      "action": {
        "name": "Create Pricing",
        "help": "Create Pricing will mint your datatokens, approve spending, and create either a pool or a fixed rate exchange in one process. You will need to approve those multiple steps in your wallet."
      }
    },
    "fixed": {
      "title": "Fixed",
      "info": "Set your price for accessing this data set. The datatoken for this data set will be worth the entered amount of OCEAN."
    },
    "dynamic": {
      "title": "Dynamic",
      "info": "Let's create a decentralized, automated market for your data set. The datatoken for this data set will be worth the entered amount of OCEAN. Additionally, you will provide liquidity into a Datatoken/OCEAN liquidity pool with Balancer.",
      "tooltips": {
        "poolInfo": "Explain what is going on here...",
        "swapFee": "Explain liquidity provider fee...",
        "communityFee": "Explain community fee...",
        "marketplaceFee": "Explain marketplace fee..."
      }
    }
  },
  "pool": {
    "tooltips": {
      "price": "Explain how this price is determined...",
      "liquidity": "Explain what this represents, advantage of providing liquidity..."
    },
    "add": {
      "title": "Add Liquidity",
      "output": {
        "titleIn": "You will receive",
        "titleOut": "You will earn"
      },
      "action": "Approve & Supply",
      "warning": "Use at your own risk. Please familiarize yourself [with the risks](https://blog.oceanprotocol.com/on-staking-on-data-in-ocean-market-3d8e09eb0a13) and the [Terms of Use](/terms)."
    },
    "remove": {
      "title": "Remove Liquidity",
      "simple": "Set the amount of your pool shares to spend. You will get the equivalent value in OCEAN, limited to maximum amount for pool protection. If you have Datatokens left in your wallet, you can add them to the pool to increase the maximum amount.",
      "advanced": "Set the amount of your pool shares to spend. You will get OCEAN and Datatokens equivalent to your pool share, without any limit. You can use these Datatokens in other DeFi tools.",
      "output": {
        "titleIn": "You will spend",
        "titleOut": "You will receive"
      },
      "action": "Approve & Remove"
    }
  },

  "trade":{
    "title":"Swap tokens",
    "action": "Approve & Swap"
  }
}
